[
  {
    "id" : "96f0ffee-076d-4ea4-a21d-fec2f37813e0",
    "prId" : 3289,
    "prUrl" : null,
    "prSource" : "GitHub",
    "comments" : [
      {
        "id" : "39dc0f84-3dd6-4153-90e5-e689251ac9f5",
        "parentId" : null,
        "authorId" : "762e53b3-7c6a-4fbb-8098-a2c522dd50a6",
        "body" : "Given the somewhat disjointed style used in README files, it's not 100% clear that this new note about deprecation warnings applies _only_ to running numpy.test. Could we make it something like\n\nStarting in NumPy 1.7, any test which triggers a deprecation warning will automatically fail, so the -Wd command-line option is no longer necessary for running the test suite.\n\n(Also, does this change really apply only to deprecation warnings, or to all warnings in general?)\n",
        "createdAt" : "2013-04-29T15:59:51Z",
        "updatedAt" : "2013-04-29T15:59:51Z",
        "lastEditedBy" : "762e53b3-7c6a-4fbb-8098-a2c522dd50a6",
        "tags" : [
        ]
      },
      {
        "id" : "7024a026-4bfd-467a-806b-d5a02fc817bc",
        "parentId" : "39dc0f84-3dd6-4153-90e5-e689251ac9f5",
        "authorId" : "85b881e8-d8a0-43d4-81d3-7e233dc5f1ae",
        "body" : "If you like. I was just keeping both copies in synch since I was touching both files. I didn't write this line; it originates in the root `README.txt`.\n",
        "createdAt" : "2013-04-29T16:10:00Z",
        "updatedAt" : "2013-04-29T16:10:00Z",
        "lastEditedBy" : "85b881e8-d8a0-43d4-81d3-7e233dc5f1ae",
        "tags" : [
        ]
      },
      {
        "id" : "5d4f3170-9d09-4405-9ff5-ee03c7d68cbe",
        "parentId" : "39dc0f84-3dd6-4153-90e5-e689251ac9f5",
        "authorId" : "762e53b3-7c6a-4fbb-8098-a2c522dd50a6",
        "body" : "Ah, so it does. If you're poking at these anyway, could you maybe update both, then? It certainly confused me for a moment just now.\n",
        "createdAt" : "2013-04-29T16:34:00Z",
        "updatedAt" : "2013-04-29T16:34:00Z",
        "lastEditedBy" : "762e53b3-7c6a-4fbb-8098-a2c522dd50a6",
        "tags" : [
        ]
      },
      {
        "id" : "952d0715-d0da-439d-a23f-2e990d04d4ab",
        "parentId" : "39dc0f84-3dd6-4153-90e5-e689251ac9f5",
        "authorId" : "762e53b3-7c6a-4fbb-8098-a2c522dd50a6",
        "body" : "Actually, wait a moment... looking at numpy/testing/nosetester.py, this comment in the README is just wrong, I think. By default in released versions, the tests do _not_ fail on any warnings, and in develop versions, they do. And the `-Wd` option is ignored in any case (we always call `warnings.resetwarnings()` before running the tests, which wipes out any `-Wd` options).\n\nIt looks like once upon a time (see d93d0214eaec2cd45119ad1f7485e5628faffc2a), we suggested that people use `-Wd` to turn on fail-on-deprecation for their first run of the test suite after upgrading. I have no idea why we did that -- it makes sense that they might want to test _their_ code with deprecation warnings on before upgrading, but why test numpy that way? If there is some reason, though, then the way they should do that now is something like\n\n```\npython -c \"import numpy; numpy.test(raise_warnings=(DeprecationWarning,))'\n```\n\nAlternatively, if the defaults are good (which seems accurate to me), we should just delete these comments entirely.\n",
        "createdAt" : "2013-04-29T16:40:55Z",
        "updatedAt" : "2013-04-29T16:40:55Z",
        "lastEditedBy" : "762e53b3-7c6a-4fbb-8098-a2c522dd50a6",
        "tags" : [
        ]
      }
    ],
    "commit" : "c7c4d40895b5e7824a71e5673a7c1ad378c08638",
    "line" : 12,
    "diffHunk" : "@@ -1,1 +18,22 @@\nStarting in NumPy 1.7, deprecation warnings have been set to 'raise' by\ndefault, so the -Wd command-line option is no longer necessary.\n\nThe most current development version is always available from our"
  }
]