[
  {
    "id" : "deb2a79f-e412-4b62-896a-5d82d3909621",
    "prId" : 66971,
    "prUrl" : "https://github.com/kubernetes/kubernetes/pull/66971#pullrequestreview-145146314",
    "prSource" : "GitHub",
    "comments" : [
      {
        "id" : "c15e6e62-0e9b-4430-8584-e245e3c1fde5",
        "parentId" : null,
        "authorId" : "443f9b92-20b0-45c2-a13f-20c6f64f89eb",
        "body" : "@smarterclayton as we were talking about it; the order of events is preserved only for objects with the same key - not really sure why deltaFIFO is implemented that way. Maybe you have some context why it was done like that, if that was intentional or just that for controllers it doesn't matter.",
        "createdAt" : "2018-08-10T08:17:11Z",
        "updatedAt" : "2018-08-15T11:35:03Z",
        "lastEditedBy" : "443f9b92-20b0-45c2-a13f-20c6f64f89eb",
        "tags" : [
        ]
      },
      {
        "id" : "6c10f06e-2a6d-4672-b1e1-1421b1765bd3",
        "parentId" : "c15e6e62-0e9b-4430-8584-e245e3c1fde5",
        "authorId" : "443f9b92-20b0-45c2-a13f-20c6f64f89eb",
        "body" : "@smarterclayton you were right to question that ;) I even had a test there with a comment saying informers break order, but this predates a year back when I worked on this first time and seems like my long-term memory sucks.",
        "createdAt" : "2018-08-10T08:20:58Z",
        "updatedAt" : "2018-08-15T11:35:03Z",
        "lastEditedBy" : "443f9b92-20b0-45c2-a13f-20c6f64f89eb",
        "tags" : [
        ]
      }
    ],
    "commit" : "f6836df5dd104bde62d80be411582c5d08dcaa65",
    "line" : 35,
    "diffHunk" : "@@ -1,1 +104,108 @@// Watch method with Until. It can skip some intermediate events in case of watch function failing but it will\n// re-list to recover and you always get an event, if there has been a change, after recovery.\n// Also with the current implementation based on DeltaFIFO, order of the events you receive is guaranteed only for\n// particular object, not between more of them even it's the same resource.\n// The most frequent usage would be a command that needs to watch the \"state of the world\" and should't fail, like:"
  }
]