[
  {
    "id" : "26baff57-0815-495f-9aef-81fdd42d4446",
    "prId" : 14032,
    "prUrl" : "https://github.com/numpy/numpy/pull/14032#pullrequestreview-264486089",
    "prSource" : "GitHub",
    "comments" : [
      {
        "id" : "e1727102-fafd-4283-8522-a170d71d3e27",
        "parentId" : null,
        "authorId" : "ab55dc5f-f626-43b1-ba83-3d8843d79a45",
        "body" : "It's possibly worth noting that unlike the others, Jekyll's site-generator is run automatically by github pages (either here or below). Perhaps this is a non-issue and we can set up CI to do this step.",
        "createdAt" : "2019-07-17T04:09:38Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "ab55dc5f-f626-43b1-ba83-3d8843d79a45",
        "tags" : [
        ]
      },
      {
        "id" : "84070bd7-230a-4142-9b4b-6df2b1f4911f",
        "parentId" : "e1727102-fafd-4283-8522-a170d71d3e27",
        "authorId" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "body" : "Indeed. It's a small thing, but nice to have. CI does break once in a while.",
        "createdAt" : "2019-07-17T04:11:34Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "tags" : [
        ]
      },
      {
        "id" : "5ac34ad5-31af-4b3a-b1dd-1693ede69556",
        "parentId" : "e1727102-fafd-4283-8522-a170d71d3e27",
        "authorId" : "c884dd3a-0963-4d91-a1d5-79aeb1ecaac8",
        "body" : "> It's possibly worth noting that unlike the others, Jekyll's site-generator is run automatically by github pages\r\n\r\nIf GitLab could be an option for hosting the website, then it is much better than GitHub because it allows you to use any site-generator that you wish. This is so because it it allows you to run scripts and commands for generating the site yourself. There are also examples for different site-generators (including sphinx): https://gitlab.com/pages",
        "createdAt" : "2019-07-17T13:05:58Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "c884dd3a-0963-4d91-a1d5-79aeb1ecaac8",
        "tags" : [
        ]
      },
      {
        "id" : "1d1f618a-fec0-43de-9b0b-ca96dc535291",
        "parentId" : "e1727102-fafd-4283-8522-a170d71d3e27",
        "authorId" : "50141b93-5f41-4e8d-9ef8-c23a3d3fe1c8",
        "body" : "Not that it's my business, but having everything on one platform is very much the power of the ecosystem. Moving some elements to gitlab, I feel would be counter productive on the medium-long run.",
        "createdAt" : "2019-07-17T18:21:44Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "50141b93-5f41-4e8d-9ef8-c23a3d3fe1c8",
        "tags" : [
        ]
      },
      {
        "id" : "af4980b9-d0a2-423d-a1e5-7a06173da5cc",
        "parentId" : "e1727102-fafd-4283-8522-a170d71d3e27",
        "authorId" : "f8b2963a-7800-4e99-b97d-b5f0b97b8f43",
        "body" : "I'm unsure if Gitlab offers anything Github doesn't. Both Gitlab and Github should be completely agnostic to which generator we end up with. Github has Github Integrations, which work quite well for deployment/CI.",
        "createdAt" : "2019-07-18T00:35:05Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "f8b2963a-7800-4e99-b97d-b5f0b97b8f43",
        "tags" : [
        ]
      },
      {
        "id" : "53bcfb91-92ce-468a-b32f-a669f72a0dbd",
        "parentId" : "e1727102-fafd-4283-8522-a170d71d3e27",
        "authorId" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "body" : "added the GitHub Pages hook as an additional benefit",
        "createdAt" : "2019-07-20T06:28:17Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "tags" : [
        ]
      }
    ],
    "commit" : "9b4f8e0152da817c33ca3eeeed221846033dab55",
    "line" : 117,
    "diffHunk" : "@@ -1,1 +115,119 @@   that should be a requirement. Jekyll uses a combination of liquid templating\n   and YAML to render HTML, and content is written in Markdown. i18n\n   functionality is not native to Jekyll, but can be added easily.\n   One nice benefit of Jekyll is that it can be run automatically by GitHub\n   Pages, so deployment via a CI system doesn't need to be implemented."
  },
  {
    "id" : "d0e035c9-ac48-42bc-8616-316c98129bf9",
    "prId" : 14032,
    "prUrl" : "https://github.com/numpy/numpy/pull/14032#pullrequestreview-264486080",
    "prSource" : "GitHub",
    "comments" : [
      {
        "id" : "e1f48b16-bf69-49c7-a0ee-84b478287b58",
        "parentId" : null,
        "authorId" : "ab55dc5f-f626-43b1-ba83-3d8843d79a45",
        "body" : "Possibly not the NEP to contain this remark, but - updating the sphinx theme is an option we could consider orthogonally for the rest of the docs",
        "createdAt" : "2019-07-17T04:13:14Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "ab55dc5f-f626-43b1-ba83-3d8843d79a45",
        "tags" : [
        ]
      },
      {
        "id" : "71da5825-05e2-4642-bc05-f566950328d3",
        "parentId" : "e1f48b16-bf69-49c7-a0ee-84b478287b58",
        "authorId" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "body" : "Good point. @Shekharrajak has been looking into this. The current theme is starting to feel a little dated.",
        "createdAt" : "2019-07-17T04:14:19Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "tags" : [
        ]
      },
      {
        "id" : "a4781db2-bcc1-4c64-9369-b6fef89ab89f",
        "parentId" : "e1f48b16-bf69-49c7-a0ee-84b478287b58",
        "authorId" : "35568337-97d4-41f9-b78c-553b549a22d7",
        "body" : "I believe, Static Site for the landing page (and all other static content) can be written in Markdown (.md) file and the  Python API documents (which is generated using Sphinx documentation processing tool) should be generated using Sphinx(because Sphinx is best for Python API documentation generator) only. \r\n\r\nWe will be having new (maybe similar to the landing page theme) styling.\r\n\r\nThe motive behind Markdown is :\r\n\r\n1. Easy to edit the static contents. So more users/contributors can be engaged if they want something to add/modify.\r\n2. NumPy team can add blogs or news easily and it will be deployed immediately using Github Hook. (Sphinx generated pages will remain the same. It will be changed only when there is new release).\r\n3. Most of the Static Site Generators are using Markdown (Here Jekyll, Hugo, docusaurus), so if in future we want to move to other frameworks then we just need to move the .md files accordingly.",
        "createdAt" : "2019-07-17T05:27:03Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "35568337-97d4-41f9-b78c-553b549a22d7",
        "tags" : [
        ]
      },
      {
        "id" : "24f619e7-1285-4b0f-8341-bc80f3a8feb4",
        "parentId" : "e1f48b16-bf69-49c7-a0ee-84b478287b58",
        "authorId" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "body" : "> updating the sphinx theme is an option we could consider orthogonally for the rest of the docs\r\n\r\nadded this as a note",
        "createdAt" : "2019-07-20T06:27:44Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "tags" : [
        ]
      }
    ],
    "commit" : "9b4f8e0152da817c33ca3eeeed221846033dab55",
    "line" : 313,
    "diffHunk" : "@@ -1,1 +311,315 @@   take the least amount of resources initially, however, Sphinx does not have\n   the features we are looking for moving forward such as i18n, responsive design,\n   and a clean, modern look.\n   Note that updating the docs Sphinx theme is likely still a good idea - it's\n   orthogonal to this NEP though."
  },
  {
    "id" : "afc501b1-e8cd-4e52-a654-275c7426ac17",
    "prId" : 14032,
    "prUrl" : "https://github.com/numpy/numpy/pull/14032#pullrequestreview-264822353",
    "prSource" : "GitHub",
    "comments" : [
      {
        "id" : "647c7c53-9dd8-48ec-92ca-ddb9dde2db40",
        "parentId" : null,
        "authorId" : "677805c9-b293-4cf2-bdba-518f5fcde824",
        "body" : "I disagree with this point. While I'm surely not a fan of Sphinx, it can have a clean modern look, and it has i18n support (not sure if there are limitations to it, but afaik content can be translated with `.po` files).\r\n\r\nFor pandas we're planning to do the opposite as this NEP proposes. We have https://pandas.pydata.org independent from the docs (it's also Sphinx, but could be any static website generator), and we're planning to integrate it with the docs, which should make things simpler to maintain.\r\n\r\nWe've got a prototype to experiment with the styles, you can see it here: https://dev.pandas.io/pandas-sphinx-theme/pr-datapythonista_base/. It's using https://github.com/ryan-roemer/sphinx-bootstrap-theme, the maintainers of the project have been helpful in the past, and they are open to adapt the theme for our needs.\r\n\r\nIt is responsive, and I would say the look is modern (at least compared to our current docs). If it's not, it can be improved with a designer modifying the css (I don't have great designing skills myself). I was experimenting on not having a navigation bar (that's why in the black header there are no links), but they come by default and we'll have them.\r\n\r\nI'd personally be very happy to not have to deal with Sphinx, but since the plan is using it for the docs anyway, I think doesn't add much value to have a separate website, and two systems to maintain. Customizing Sphinx will require some work, but since we're going to do it for pandas, there will be no extra work to do for numpy/scipy.\r\n\r\nAnd personally, I think the closer the docs/website of numpy, pandas and the rest of the ecosystem are, the better. Whatever is the final solution, I think we should follow the same approach, and also standardize the names of the sections and the main structure of the website/docs.",
        "createdAt" : "2019-07-17T09:32:31Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "677805c9-b293-4cf2-bdba-518f5fcde824",
        "tags" : [
        ]
      },
      {
        "id" : "6ba085e2-0f7b-4aa5-abf1-ef718791ea08",
        "parentId" : "647c7c53-9dd8-48ec-92ca-ddb9dde2db40",
        "authorId" : "35568337-97d4-41f9-b78c-553b549a22d7",
        "body" : "> I disagree with this point. While I'm surely not a fan of Sphinx, it can have a clean modern look, and it has i18n support (not sure if there are limitations to it, but afaik content can be translated with `.po` files).\r\n\r\nThanks for pointing it out. I came across talk about [Multilingual support for Sphinx](https://www.slideshare.net/streetcleaner/writing-multi-language-documentation-using-sphinx).  I will explore it.\r\n\r\nThe idea behind this is - We will write on simple english and out Statis Site generator will translate it to multi languages like the way docusaurus do : https://docusaurus.io/docs/en/translation\r\n\r\n\r\n> For pandas we're planning to do the opposite as this NEP proposes. We have https://pandas.pydata.org independent from the docs (it's also Sphinx, but could be any static website generator), and we're planning to integrate it with the docs, which should make things simpler to maintain.\r\n> \r\n> We've got a prototype to experiment with the styles, you can see it here: https://dev.pandas.io/pandas-sphinx-theme/pr-datapythonista_base/. It's using https://github.com/ryan-roemer/sphinx-bootstrap-theme, the maintainers of the project have been helpful in the past, and they are open to adapt the theme for our needs.\r\n\r\nThanks for sharing these links.\r\n\r\n> It is responsive, and I would say the look is modern (at least compared to our current docs). If it's not, it can be improved with a designer modifying the css (I don't have great designing skills myself). I was experimenting on not having a navigation bar (that's why in the black header there are no links), but they come by default and we'll have them.\r\n> \r\n> I'd personally be very happy to not have to deal with Sphinx, but since the plan is using it for the docs anyway, I think doesn't add much value to have a separate website, and two systems to maintain. Customizing Sphinx will require some work, but since we're going to do it for pandas, there will be no extra work to do for numpy/scipy.\r\n\r\nActually, the plan is having one website (numpy.org) landing page (and all other static pages like About, User Guide, News, tutorials ) will be generated using SSG (docusaurus/jekyll/Hugo) and `numpy.org/docs` will contain the generated build of Sphinx (which will be having Python API docstrings).\r\n\r\nSo it may engage reader/contributors to modify the Static file because it will be written in simple Markdown (like plain text), so need to setup SSG  framework. Also writing blogs or news about numpy will be easy using SSG.\r\n \r\n> And personally, I think the closer the docs/website of numpy, pandas and the rest of the ecosystem are, the better. Whatever is the final solution, I think we should follow the same approach, and also standardize the names of the sections and the main structure of the website/docs.\r\n\r\n",
        "createdAt" : "2019-07-17T15:38:06Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "35568337-97d4-41f9-b78c-553b549a22d7",
        "tags" : [
        ]
      },
      {
        "id" : "b51e8d73-84bc-49b3-9726-9c4cd28e544c",
        "parentId" : "647c7c53-9dd8-48ec-92ca-ddb9dde2db40",
        "authorId" : "677805c9-b293-4cf2-bdba-518f5fcde824",
        "body" : "> So it may engage reader/contributors to modify the Static file because it will be written in simple Markdown\r\n\r\nI agree on this, but is this different than with Sphinx? If you're going to have the documentation in markdown for sphinx, having to maintain another system that does the same is what I don't understand. Or do you mean having markdown as opposed as Sphinx rst?",
        "createdAt" : "2019-07-17T15:50:11Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "677805c9-b293-4cf2-bdba-518f5fcde824",
        "tags" : [
        ]
      },
      {
        "id" : "69bd81df-55a0-4110-bd98-8d3c2c724c6c",
        "parentId" : "647c7c53-9dd8-48ec-92ca-ddb9dde2db40",
        "authorId" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "body" : "> we're planning to integrate it with the docs, which should make things simpler to maintain.\r\n\r\nThis is a no-go I think. The website builds in seconds, the docs take 10 minutes and require things like LaTeX. We even have a separate build for NEPs (which is fine in Sphinx), because people felt it was better to have that build fast.\r\n\r\n> While I'm surely not a fan of Sphinx, it can have a clean modern look\r\n\r\nEverything is possible, but there are no examples of this I can think of (after a decade of all of us doing everything in Sphinx ....). Sphinx is for docs, not for websites. In theory you can build something like https://jupyter.org/ (or https://pytorch.org/ or https://www.tensorflow.org/) on Sphinx, but it will be extremely painful and much harder to maintain than Hugo or Jekyll.\r\n\r\nI want to engage people with good web dev skills, rather than adapt the tool to the experience of the current maintainers. There won't be many web developers who will think it's reasonable to build a static site with smaller amounts of text but modern styling, some graphics, etc. in Sphinx.\r\n\r\n> We've got a prototype to experiment with the styles, you can see it here: https://dev.pandas.io/pandas-sphinx-theme/pr-datapythonista_base/. \r\n\r\nThat looks like a significant improvement over the current site, nice.\r\n\r\n> And personally, I think the closer the docs/website of numpy, pandas and the rest of the ecosystem are, the better.\r\n\r\nThat may be true. I'd rather follow Jupyter though, as the current best site in our ecosystem. \r\n",
        "createdAt" : "2019-07-17T23:04:39Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "tags" : [
        ]
      },
      {
        "id" : "158dbc34-2455-4260-9303-c5e872305401",
        "parentId" : "647c7c53-9dd8-48ec-92ca-ddb9dde2db40",
        "authorId" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "body" : "> I agree on this, but is this different than with Sphinx? If you're going to have the documentation in markdown for sphinx, having to maintain another system that does the same is what I don't understand. Or do you mean having markdown as opposed as Sphinx rst?\r\n\r\nno we won't change the docs system - 1500 pages of text can't be changed away from Sphinx. \r\n\r\nit's just about numpy.org, which right now has about 1.5-2 pages worth of text.",
        "createdAt" : "2019-07-17T23:07:05Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "tags" : [
        ]
      },
      {
        "id" : "e73966f3-5cc3-44df-95a7-edf69e200bcd",
        "parentId" : "647c7c53-9dd8-48ec-92ca-ddb9dde2db40",
        "authorId" : "677805c9-b293-4cf2-bdba-518f5fcde824",
        "body" : "I think having a fresh, good looking website depends almost exclusively of the work in the CSS. If you have someone with good design skills, who spend enough time making the page look good, it will look good no matter if it's built with Sphinx, Pelican, Jekyll or whatever. Of course the html has to be generated in the appropriate way. There are limitations in every static site generator, and in Sphinx the amount of work to change things is higher (you can see https://github.com/pandas-dev/pandas/issues/23763 for reference of my feelings when I tried to customize the table of contents).\r\n\r\nFor me the trade off is between how annoying is to deal with Sphinx to customize the html, and how annoying is to maintain two separate systems.\r\n\r\nThe good news is that the CSS is somehow independent of how the html is generated. So, I don't think it's a big deal to make the wrong choice to start with. The amount of work to move from Sphinx to Jekyll or the opposite should be much smaller than the work to create the CSS I think.\r\n\r\nRegarding the build time, in pandas we have a script `doc/make.py` that we can call with a `--single` parameter to generate a single page. We also have a parameter `--no-api` to skip the API documentation, which takes a most of the time to build. It'd also be easy to add a parameter to build only the website and not the docs, or to skip running the code examples, and Sphinx would be extremely fast.\r\n\r\nOne thing to consider is how often you want to update the website compared to the the docs. Meaning that if you have all together, and you want to change the home page, you need to wait for the next release for users to see it. We're considering having a blog built with the docs in Sphinx, and that would be a problem. There is a solution if your website is hosted behind nginx, which is to redirect to the dev docs with nginx rules (which would be transparent for the users, they'd still see the same domain). That is quite simple to implement and would be useful also for parts of the documentation, like the contributing guide, which users usually care about the most updated version and not the last stable.\r\n\r\nSo, my summary:\r\n- Dealing with Sphinx is not great, but since you're going to use it for the docs, it's worth considering it for the website too\r\n- I don't think how nice the website looks depends much on what you use to generate the html (more on the amount of work you put in the css, and sphinx has a setting to specify your custom css files, that's trivial)\r\n- Having the website separate has surely some advantages, but I don't think they are the building time, how good the website looks, or being responsive. Probably they are not making people who deal with the website have to clone the whole numpy, and how often you can release\r\n- pandas website is most of the time outdated, while the docs are updated, besides having to maintain two systems, deal with two repos, deploy two separate sites... I think that's the main reason to consider building the website with sphinx. Also having a single domain with unified style (you can address that with separate websites, but it's tricker).\r\n\r\nCC: @jorisvandenbossche @stijnvanhoey may be you are interested in this discussion",
        "createdAt" : "2019-07-18T09:39:35Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "677805c9-b293-4cf2-bdba-518f5fcde824",
        "tags" : [
        ]
      },
      {
        "id" : "4e1e93e9-b94f-44a3-b561-8736f819c9e1",
        "parentId" : "647c7c53-9dd8-48ec-92ca-ddb9dde2db40",
        "authorId" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "body" : "thanks @datapythonista. that issue with Sphinx customization feels familiar:)\r\n\r\n> Meaning that if you have all together, and you want to change the home page, you need to wait for the next release for users to see it.\r\n\r\nyeah, I don't think a 1-6 month wait is acceptable. also, the website is conceptually independent from a release.\r\n\r\n> Dealing with Sphinx is not great, but since you're going to use it for the docs, it's worth considering it for the website too\r\n\r\nI'm having in mind that these are largely separate (groups of) people developing it. And in the end both are just a `make html`. \r\n\r\n> I don't think how nice the website looks depends much on what you use to generate the html\r\n\r\nthis is the point I disagree with most. experience shows that it's just not true for Sphinx. it may be true _in theory_, but that's like saying it doesn't matter whether you choose Perl or Python \r\n\r\n> pandas website is most of the time outdated,\r\n\r\nthe NumPy one too, and that's largely because people who care about code first and everything  else second. we now have a good amount of energy from new people (with better web dev skills, or interest in educational materials, marketing, etc.). ",
        "createdAt" : "2019-07-18T14:48:01Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "tags" : [
        ]
      },
      {
        "id" : "4034923a-21c6-42b5-98a4-f911e2ffb802",
        "parentId" : "647c7c53-9dd8-48ec-92ca-ddb9dde2db40",
        "authorId" : "50141b93-5f41-4e8d-9ef8-c23a3d3fe1c8",
        "body" : "For what it worth, we have a separate repo for the astropy webpage, and it is indeed very nice not to be tied to the release cycle of the repo (including not to have a different webpage for LTS/bugfix/latest releases).",
        "createdAt" : "2019-07-18T16:24:50Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "50141b93-5f41-4e8d-9ef8-c23a3d3fe1c8",
        "tags" : [
        ]
      },
      {
        "id" : "9696e5c8-0cfb-48be-ba23-54df3fb61e4e",
        "parentId" : "647c7c53-9dd8-48ec-92ca-ddb9dde2db40",
        "authorId" : "f8b2963a-7800-4e99-b97d-b5f0b97b8f43",
        "body" : "I feel the need to respond to this thread since I wrote what we're discussing here in the NEP :) \r\nI'll admit I took my own experiences with Sphinx into account without knowing much about its theming. I'll also admit I don't like Sphinx much, but it sounds like I'm not alone! At best, what I wrote in the NEP isn't very objective, so I'm open to editing this line.\r\n\r\nI'd also like to preface I've been a front-end developer for years, so I'm hoping I can help steer a bit and correct any misconceptions, answer questions, and whatnot.\r\n\r\n> For me the trade off is between how annoying is to deal with Sphinx to customize the html, and how annoying is to maintain two separate systems.\r\n\r\nIf it truly is _annoying_ to customize html in Sphinx, I think that alone is a dealbreaker for writing the landing page in Sphinx. You also mentioned:\r\n\r\n> Probably they are not making people who deal with the website have to clone the whole numpy, and how often you can release\r\n\r\nI haven't cloned NumPy, but it already sounds large. I'd imagine this would slow down development for a relatively small landing page, and beyond that, I doubt we'd want releases focused around landing page changes.\r\n\r\n> Having the website separate has surely some advantages, but I don't think they are the building time, how good the website looks, or being responsive.\r\n\r\nBuild time is probably an advantage. I don't know how long it takes NumPy to build, but it sounds like it might take a little bit. Without NumPy (i.e. standalone Jekyll static page), build time should be seconds. You're right about the other two.\r\n\r\n> I don't think how nice the website looks depends much on what you use to generate the html (more on the amount of work you put in the css, and sphinx has a setting to specify your custom css files, that's trivial)\r\n\r\nYou're right :) However, you mentioned:\r\n\r\n> The good news is that the CSS is somehow independent of how the html is generated. So, I don't think it's a big deal to make the wrong choice to start with. The amount of work to move from Sphinx to Jekyll or the opposite should be much smaller than the work to create the CSS I think.\r\n\r\nThis unfortunately isn't accurate. I wish it was. CSS rules work differently depending on your HTML structure since CSS _does_ care about parent/child elements. So given some really decent CSS, we couldn't port _just_ the CSS without an identical HTML structure and expect it to work properly.\r\n\r\nI think the docs and the website should be separated. However, it seems like there's consensus around the docs staying put in Sphinx for several packages (Pandas, AstroPy, etc.), which is great. I do think it would be a bonus if multiple packages _did_ have the same styling, which would make navigating much easier for users of all packages.\r\n\r\n",
        "createdAt" : "2019-07-19T22:18:00Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "f8b2963a-7800-4e99-b97d-b5f0b97b8f43",
        "tags" : [
        ]
      },
      {
        "id" : "b2de6765-09d6-4254-993a-59c908005658",
        "parentId" : "647c7c53-9dd8-48ec-92ca-ddb9dde2db40",
        "authorId" : "677805c9-b293-4cf2-bdba-518f5fcde824",
        "body" : "We mostly agree, just two things I didn't explain well and I think you misunderstood.\r\n\r\nIt's very easy to have the website in the docs, and be able to call something like `doc/make.py --website-only` and the website build will take couple of seconds. In pandas we're doing similar things.\r\n\r\nEditting the CSS in Sphinx is trivial (same as in whatever else). The reason is more complex to add style is because changing the html is not as easy as just changing the template for things like the toc tree. That's why I said moving from Sphinx to Jekyll or the other way is doable; the work needed would be just to make the html the same (or close enough for the css).\r\n\r\nAlso, worth mentioning that for most parts of the website, changing the Sphinx templates should be enough, and for special pages (like the home in the pandas new look I sent) html can be used directly.",
        "createdAt" : "2019-07-21T08:58:38Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "677805c9-b293-4cf2-bdba-518f5fcde824",
        "tags" : [
        ]
      },
      {
        "id" : "340b3d10-b6db-42e3-828a-fc59bdd0ca73",
        "parentId" : "647c7c53-9dd8-48ec-92ca-ddb9dde2db40",
        "authorId" : "f8b2963a-7800-4e99-b97d-b5f0b97b8f43",
        "body" : "Understood, thank you for clarifying!",
        "createdAt" : "2019-07-22T13:42:09Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "f8b2963a-7800-4e99-b97d-b5f0b97b8f43",
        "tags" : [
        ]
      }
    ],
    "commit" : "9b4f8e0152da817c33ca3eeeed221846033dab55",
    "line" : 313,
    "diffHunk" : "@@ -1,1 +311,315 @@   take the least amount of resources initially, however, Sphinx does not have\n   the features we are looking for moving forward such as i18n, responsive design,\n   and a clean, modern look.\n   Note that updating the docs Sphinx theme is likely still a good idea - it's\n   orthogonal to this NEP though."
  },
  {
    "id" : "706f7c0d-1736-4581-ba02-e946ab9ca385",
    "prId" : 14032,
    "prUrl" : "https://github.com/numpy/numpy/pull/14032#pullrequestreview-264485871",
    "prSource" : "GitHub",
    "comments" : [
      {
        "id" : "8410d2ef-599f-47ef-823b-5f0e9a6b6b5b",
        "parentId" : null,
        "authorId" : "919d650d-5f9e-4069-90f7-968e2cf7bb16",
        "body" : "\"will migrate\" -> \"may migrate\" (with high probability)",
        "createdAt" : "2019-07-17T13:34:46Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "919d650d-5f9e-4069-90f7-968e2cf7bb16",
        "tags" : [
        ]
      },
      {
        "id" : "078628cc-5bda-49f9-9ae0-c49ee959fde1",
        "parentId" : "8410d2ef-599f-47ef-823b-5f0e9a6b6b5b",
        "authorId" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "body" : "it is \"will\", staying with Sphinx is in the rejected alternatives. resolving this.",
        "createdAt" : "2019-07-20T06:18:59Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "tags" : [
        ]
      }
    ],
    "commit" : "9b4f8e0152da817c33ca3eeeed221846033dab55",
    "line" : 298,
    "diffHunk" : "@@ -1,1 +296,300 @@numpy.org (the website, *not including the docs*). The current deployment can\nbe preserved until a future deprecation date is decided (potentially based on\nthe comfort level of our new site).\n\nAll site generators listed above have visibility into the HTML and Javascript"
  },
  {
    "id" : "805891a0-b967-43f0-847b-ec0cf9694683",
    "prId" : 14032,
    "prUrl" : "https://github.com/numpy/numpy/pull/14032#pullrequestreview-264486064",
    "prSource" : "GitHub",
    "comments" : [
      {
        "id" : "fc346bbf-a5f6-4dce-a1e0-4c0ea3893729",
        "parentId" : null,
        "authorId" : "50141b93-5f41-4e8d-9ef8-c23a3d3fe1c8",
        "body" : "would be better to have multiple, the bus factor effect in this regime could be ever more present",
        "createdAt" : "2019-07-17T18:42:44Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "50141b93-5f41-4e8d-9ef8-c23a3d3fe1c8",
        "tags" : [
        ]
      },
      {
        "id" : "34b7e86d-e7a3-4de8-bb6f-e9fed45740a1",
        "parentId" : "fc346bbf-a5f6-4dce-a1e0-4c0ea3893729",
        "authorId" : "50141b93-5f41-4e8d-9ef8-c23a3d3fe1c8",
        "body" : "(Coming from a very small language, it was always frustrating to see that after the initial inertia and team disappeared the translated pages in that language are both outdated and incomplete, and can't remember any examples that relied on people doing the translation rather than an automated framework. )",
        "createdAt" : "2019-07-17T18:46:01Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "50141b93-5f41-4e8d-9ef8-c23a3d3fe1c8",
        "tags" : [
        ]
      },
      {
        "id" : "8b1f3ecf-69f0-44f5-b8f8-6c422a8626ed",
        "parentId" : "fc346bbf-a5f6-4dce-a1e0-4c0ea3893729",
        "authorId" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "body" : "Agreed, more is better. Let's see what others think - should we require at least two people?",
        "createdAt" : "2019-07-17T22:45:00Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "tags" : [
        ]
      },
      {
        "id" : "1c33feb3-4a27-4d6f-8f40-b7db60e19083",
        "parentId" : "fc346bbf-a5f6-4dce-a1e0-4c0ea3893729",
        "authorId" : "50141b93-5f41-4e8d-9ef8-c23a3d3fe1c8",
        "body" : "I would think a clear policy when to disable a translation would be preferable. Even if there are two volunteers right now, there is no guarantee that 1-5-10 years down the line still there is. And removing things is always difficult, having a clear guideline would be then useful (e.g. remove by default once there isn't two people around to actively maintain it).",
        "createdAt" : "2019-07-17T23:00:09Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "50141b93-5f41-4e8d-9ef8-c23a3d3fe1c8",
        "tags" : [
        ]
      },
      {
        "id" : "875225c7-6767-4e97-8a18-ceccaed63b5d",
        "parentId" : "fc346bbf-a5f6-4dce-a1e0-4c0ea3893729",
        "authorId" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "body" : "> I would think a clear policy when to disable a translation would be preferable.\r\n\r\nagreed. I wrote a bit about that, but I should probably make it more explicit.",
        "createdAt" : "2019-07-18T14:49:52Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "tags" : [
        ]
      },
      {
        "id" : "38d43bba-77c4-4667-8dc1-660468296a21",
        "parentId" : "fc346bbf-a5f6-4dce-a1e0-4c0ea3893729",
        "authorId" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "body" : "I added a section with a policy. thanks @bsipocz ",
        "createdAt" : "2019-07-20T06:26:34Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "tags" : [
        ]
      }
    ],
    "commit" : "9b4f8e0152da817c33ca3eeeed221846033dab55",
    "line" : 240,
    "diffHunk" : "@@ -1,1 +238,242 @@We propose the following requirements for adding a language:\n\n- The language must have a dedicated maintainer\n- There must be a way to validate content changes (e.g. a second\n  maintainer/reviewer, or high quality language support in a freely"
  },
  {
    "id" : "8b8466e0-951a-4f5f-8d8a-f67d83a57475",
    "prId" : 14032,
    "prUrl" : "https://github.com/numpy/numpy/pull/14032#pullrequestreview-264485858",
    "prSource" : "GitHub",
    "comments" : [
      {
        "id" : "8a543518-471d-446b-b47f-7ab2d5183b76",
        "parentId" : null,
        "authorId" : "50141b93-5f41-4e8d-9ef8-c23a3d3fe1c8",
        "body" : "isn't sphinx a viable 4th option, based on the pandas experience?",
        "createdAt" : "2019-07-17T18:47:03Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "50141b93-5f41-4e8d-9ef8-c23a3d3fe1c8",
        "tags" : [
        ]
      },
      {
        "id" : "9832af46-cbd8-4cf1-8ec1-823f4a4b91d9",
        "parentId" : "8a543518-471d-446b-b47f-7ab2d5183b76",
        "authorId" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "body" : "Based on a decade of experience, I think no. There are literally zero sites I can think of that pulled this off with Sphinx. And https://pandas.pydata.org/ does not look good imho.",
        "createdAt" : "2019-07-17T22:43:39Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "tags" : [
        ]
      },
      {
        "id" : "6fffb11f-e226-4e40-bcb4-adbb4c2f598a",
        "parentId" : "8a543518-471d-446b-b47f-7ab2d5183b76",
        "authorId" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "body" : "since there's a longer conversation on this topic, I'll resolve this one.",
        "createdAt" : "2019-07-20T06:18:27Z",
        "updatedAt" : "2019-08-06T00:00:14Z",
        "lastEditedBy" : "8ffdfffb-d8d9-40f6-9de3-dd0dee381149",
        "tags" : [
        ]
      }
    ],
    "commit" : "9b4f8e0152da817c33ca3eeeed221846033dab55",
    "line" : 136,
    "diffHunk" : "@@ -1,1 +134,138 @@   Crowdin_, document versioning, and document search.\n\nBoth Jekyll and Hugo are excellent options that should be supported into the\nfuture and are good choices for NumPy. Docusaurus has several bonus features\nsuch as versioning and search that Jekyll and Hugo don't have, but is likely"
  }
]