[
  {
    "id" : "97ad9552-50c9-489d-a59d-d80bc302054a",
    "prId" : 12075,
    "prUrl" : null,
    "prSource" : "GitHub",
    "comments" : [
      {
        "id" : "1aee92bc-385d-4466-bbae-15f0ac77757a",
        "parentId" : null,
        "authorId" : "30fc1801-f8f1-4cc4-9690-e31e203f4f6d",
        "body" : "shouldn't we do this on password input? as this is an issue with all passwrods\n",
        "createdAt" : "2015-08-25T15:07:43Z",
        "updatedAt" : "2015-08-25T19:43:24Z",
        "lastEditedBy" : "30fc1801-f8f1-4cc4-9690-e31e203f4f6d",
        "tags" : [
        ]
      },
      {
        "id" : "56db22bf-2757-4681-8fb8-76977d31b6f1",
        "parentId" : "1aee92bc-385d-4466-bbae-15f0ac77757a",
        "authorId" : "838eb58c-0fa8-4742-994f-a407c7183e57",
        "body" : "Probably not, but passwords are a little special so a case could be made:   In general we want our strategy to be unicode type internally and bytes type when we actually use it.  That way if we manipulate the string in some way (measure its length, concatenate it, strip whitespace characters, etc) there's no problems with bytes doing the wrong thing or getting mixed with unicode.  By keeping everything unicode type internally there's no confusion of what type you're dealing with and it keeps unnecessary conversions to a minimum (to_bytes and to_unicode are pretty good about unnecessary conversions but we still have the function call overhead and a few conditionals everytime we call it.)\n\nFor passwords, we do very few of these things.  So it may make sense to carry the byte type all the way through from input to output.  However, that requires tracing a lot of code, finding all the places we input vault passwords and making sure that they maintain the proper type all the way through.\n\nSince the vault code that uses the password as a byte string is self-contained inside or behind VaultLib, I think it makes sense to do this transformation here and then check the rest of the code at our leisure later.\n",
        "createdAt" : "2015-08-25T19:12:01Z",
        "updatedAt" : "2015-08-25T19:43:24Z",
        "lastEditedBy" : "838eb58c-0fa8-4742-994f-a407c7183e57",
        "tags" : [
        ]
      }
    ],
    "commit" : "a3fd4817ef1c6251d2a39e29fff29320b4c22222",
    "line" : 38,
    "diffHunk" : "@@ -1,1 +108,112 @@\n    def __init__(self, password):\n        self.b_password = to_bytes(password, errors='strict', encoding='utf-8')\n        self.cipher_name = None\n        self.b_version = b'1.1'"
  }
]