[
  {
    "id" : "497b6050-5843-45c6-9089-6ec1fa38ebe7",
    "prId" : 8991,
    "prUrl" : "https://github.com/apache/airflow/pull/8991#pullrequestreview-417714171",
    "prSource" : "GitHub",
    "comments" : [
      {
        "id" : "2b60d216-390e-474c-bb79-7d860aecbb65",
        "parentId" : null,
        "authorId" : "f73f66ab-2657-4a50-be7a-2ca3ca98c202",
        "body" : "Why the downgrade?",
        "createdAt" : "2020-05-25T13:04:09Z",
        "updatedAt" : "2020-05-25T22:39:21Z",
        "lastEditedBy" : "f73f66ab-2657-4a50-be7a-2ca3ca98c202",
        "tags" : [
        ]
      },
      {
        "id" : "2bd3d85a-4ed6-483e-9e94-f85b2c65ea21",
        "parentId" : "2b60d216-390e-474c-bb79-7d860aecbb65",
        "authorId" : "e8563344-32ea-4c07-9731-a2fed8d2edf2",
        "body" : "This is what current pypi and set of dependencies dump when I run --eager update during generate-requirements. Likely triggered by a transient dependency.\r\n\r\n\r\nAs long as they work (they do - all the tests pass) I do not care too much. (and do not have to).  Those are just constraint files (the real requirements and limits are in setup.py). \r\n\r\nWe should remember those files are by-product and generated automatically (so they will change pretty much any time setup.py changes and in pretty-much unpredictable ways depending on the transient requirements). This is the same problem we had always, but what we have now is that we capture a \"working set of requirements\" that not only know can be installed but also that passes all our tests (because those changes can only be merged after all tests pass). \r\n\r\nAnd this is a set of requirements that today person running 'pip install airflow' will get anyway and we have at least a chance to see if they work. So as long as all tests pass - this is exactly what we need. And I am happy, and frankly - I have no intention to spend any time  chasing which transient requirement caused it.\r\n\r\nBut feel free to chase it if you really want though :).\r\n\r\n",
        "createdAt" : "2020-05-25T13:33:40Z",
        "updatedAt" : "2020-05-25T22:39:21Z",
        "lastEditedBy" : "e8563344-32ea-4c07-9731-a2fed8d2edf2",
        "tags" : [
        ]
      }
    ],
    "commit" : "22ce507482e56844314137d77056f4348e2fe5ad",
    "line" : 49,
    "diffHunk" : "@@ -1,1 +372,376 @@wcwidth==0.1.9\nwebsocket-client==0.57.0\nwrapt==1.11.2\nxmltodict==0.12.0\nyamllint==1.23.0"
  }
]