[
  {
    "id" : "7168f8af-43f3-4680-b74b-63ec26b3d1f0",
    "prId" : 6027,
    "prUrl" : null,
    "prSource" : "GitHub",
    "comments" : [
      {
        "id" : "4dc59ccd-3c51-47d5-8115-0624046e76a1",
        "parentId" : null,
        "authorId" : "7be32503-562e-4caa-838d-bba025e626b5",
        "body" : "a) This is going to need good tests.\n\nb) I'm not sure we want to mix with borrowed code in this way. Most/all other borrowed code is copied into Godeps or third-party. Is this file changed, or just copied?\n",
        "createdAt" : "2015-04-01T23:08:18Z",
        "updatedAt" : "2015-04-03T18:51:04Z",
        "lastEditedBy" : "7be32503-562e-4caa-838d-bba025e626b5",
        "tags" : [
        ]
      },
      {
        "id" : "4ec851e9-bf8f-412f-81dc-257e4a89cdfe",
        "parentId" : "4dc59ccd-3c51-47d5-8115-0624046e76a1",
        "authorId" : "f22a9095-b804-4932-8c62-ecb134b86477",
        "body" : "The functions are just copied. The issue is that these are all private functions listed from the encoding/json package. I don't know how to package this well because if you put them in another package, you have to change the functions to be public, which I don't know is the best idea. I had to do the exact same thing for the ghodss/yaml package, see https://github.com/ghodss/yaml/blob/master/fields.go.\n\nThe problem is that Go's rules for how it finds a field based on a struct definition and a JSON field name is an interface that Go cannot break (at least in 1.0). However, they do not expose any functions or packages to actually let you execute this lookup yourself. So I just copy/pasted the same functions that encoding/json uses to do this calculation. The functions in this file work because they are tested in the go package, and they should never be modified in here.\n",
        "createdAt" : "2015-04-03T01:27:27Z",
        "updatedAt" : "2015-04-03T18:51:04Z",
        "lastEditedBy" : "f22a9095-b804-4932-8c62-ecb134b86477",
        "tags" : [
        ]
      }
    ],
    "commit" : "2c977db1b3af70fd60e0d111e6b6ac9dfe80e0ff",
    "line" : 23,
    "diffHunk" : "@@ -1,1 +21,25 @@// Use of this source code is governed by a BSD-style\n// license that can be found in the LICENSE file.\npackage strategicpatch\n\nimport ("
  }
]