[
  {
    "id" : "ca007139-7a5a-4f62-b27e-b9bed648a4f6",
    "prId" : 55824,
    "prUrl" : "https://github.com/kubernetes/kubernetes/pull/55824#pullrequestreview-77740698",
    "prSource" : "GitHub",
    "comments" : [
      {
        "id" : "4dbf5cad-728c-454d-bb42-307b8affae4c",
        "parentId" : null,
        "authorId" : "6e2b5eda-1533-4798-a56c-432faaf38480",
        "body" : "Add two comments\r\n\r\n1. the full feature requires all kubelets to be running at least the version this was introduced + have the feature gate enabled (and what the consequences are if the kubelets aren't enabled)\r\n2. the change to user behavior - PVC deletion used to be instant, now it can be delayed indefinitely, which may break user scripting and cluster workflow automation.\r\n\r\nI assume all of the dynamic provisioner plugins will be updated to be tolerate a delete call not actually deleting the underlying resource?  This was the source of many errors on other resources that we changed like this.",
        "createdAt" : "2017-11-18T18:16:59Z",
        "updatedAt" : "2017-11-23T11:26:07Z",
        "lastEditedBy" : "6e2b5eda-1533-4798-a56c-432faaf38480",
        "tags" : [
        ]
      },
      {
        "id" : "1a305910-dd28-4500-bccd-2dd4aa10b3d3",
        "parentId" : "4dbf5cad-728c-454d-bb42-307b8affae4c",
        "authorId" : "8b64e744-955d-4523-a3b7-60fae9df0857",
        "body" : "> I assume all of the dynamic provisioner plugins will be updated to be tolerate a delete call not actually deleting the underlying resource?\r\n\r\nAs it is already implemented now, storage assets are removed only after corresponding PVCs are deleted. If we postpone deletion of a PVC in this PR, we automatically postpone deletion of the storage asset, no change needed.",
        "createdAt" : "2017-11-20T08:56:16Z",
        "updatedAt" : "2017-11-23T11:26:07Z",
        "lastEditedBy" : "8b64e744-955d-4523-a3b7-60fae9df0857",
        "tags" : [
        ]
      },
      {
        "id" : "2380d711-c1da-41d3-a8fe-6d86b7a21229",
        "parentId" : "4dbf5cad-728c-454d-bb42-307b8affae4c",
        "authorId" : "8b64e744-955d-4523-a3b7-60fae9df0857",
        "body" : "> Add two comments\r\n\r\nDo you mean comment in the admission plugin? That feels out of place. Adding to kubelet check.\r\n\r\n> 1. what the consequences are if the kubelets aren't enabled\r\n\r\nThe same as now, kubelet may run a pod whose PVC was marked as deleted or deleted. There is a tiny window of opportunity when scheduler schedules a pod, user deleted a PVC and the controller removed finalizer on PVC, so it should not happen that often.\r\n\r\nAdded a comment into kubelet\r\n\r\n> 2. the change to user behavior\r\n\r\nYes, it is.",
        "createdAt" : "2017-11-20T10:36:08Z",
        "updatedAt" : "2017-11-23T11:26:07Z",
        "lastEditedBy" : "8b64e744-955d-4523-a3b7-60fae9df0857",
        "tags" : [
        ]
      }
    ],
    "commit" : "b1b1d312474bf0dbf73d69053a1fc9c9f4f842f1",
    "line" : 78,
    "diffHunk" : "@@ -1,1 +76,80 @@}\n\n// Admit sets finalizer on all PVCs. The finalizer is removed by\n// PVCProtectionController when it's not referenced by any pod.\n//"
  }
]