[
  {
    "id" : "99a79760-feab-4bc9-9c9f-abe84ee19419",
    "prId" : 194,
    "prUrl" : "https://github.com/VirtusLab/git-machete-intellij-plugin/pull/194#pullrequestreview-396241196",
    "prSource" : "GitHub",
    "comments" : [
      {
        "id" : "117e5c79-92d5-4162-ba66-bcc279d95a1a",
        "parentId" : null,
        "authorId" : "1cbc94b1-89bf-4adc-8c1f-ad39035845fa",
        "body" : "Hmm I still don't get why we have **up** lines then since we've already got **down** lines... what's the distinction, why can't we just use `down` edges going from parent to children (??). Also maybe drop some comments here in the code",
        "createdAt" : "2020-04-17T16:49:17Z",
        "updatedAt" : "2020-04-21T18:41:10Z",
        "lastEditedBy" : "1cbc94b1-89bf-4adc-8c1f-ad39035845fa",
        "tags" : [
        ]
      },
      {
        "id" : "e26bf151-9fe7-4e94-a117-6c44f321c5d4",
        "parentId" : "117e5c79-92d5-4162-ba66-bcc279d95a1a",
        "authorId" : "d8774f13-a544-44d7-9cf3-69a9d1083f1f",
        "body" : "Oh, of course, I will comment it there and here too for you.\r\n\r\nSo the directions (up, down, right) come from the root, the anchor of the edge being drawn. This is because edges do not always go through the whole graph cells straight from up to down. Sometimes the stop in the middle of the cell, at the graph node. \r\n\r\nFor clarity have a look at a root branch node. Bearing in mind our nomenclature, it has a down edge but actually never an up edge.\r\n\r\nOn the other hand, every last sibling branch node has no down edge but it always does have an up edge.\r\n\r\nCommit node always has both up and down edges. \r\n\r\nThe most complex is the sibling branch with a child node. Here comes a little inconsistency. To this point, you could come to the conclusions that the anchor is identical to this graph node (despite the cases where edges are drawn without nodes, behind other significant nodes AND remembering that commit nodes have invisible nodes aka bullet points). This statement fails here. The anchor stays on the branch indent level, on the left from the bullet point perspective.\r\n\r\nSo actually so-called anchor is a NODE, this is a \"logical part\". The bullet point is a \"visible part\". \r\n",
        "createdAt" : "2020-04-20T08:26:15Z",
        "updatedAt" : "2020-04-21T18:41:10Z",
        "lastEditedBy" : "d8774f13-a544-44d7-9cf3-69a9d1083f1f",
        "tags" : [
        ]
      }
    ],
    "commit" : "1ab529e3b7789221ec1c229eb7273250720a5016",
    "line" : 35,
    "diffHunk" : "@@ -1,1 +33,37 @@\n  @UIEffect\n  private void paintUpLine(Graphics2D g2, Color color, int posInRow) {\n    int nodeWidth = PaintParameters.getNodeWidth(getRowHeight());\n    int x = nodeWidth * posInRow + nodeWidth / 2;"
  }
]