[
  {
    "id" : "da9866dc-666a-4b8e-be7c-f6b5d68ccb86",
    "prId" : 63056,
    "prUrl" : "https://github.com/ansible/ansible/pull/63056#pullrequestreview-298245828",
    "prSource" : "GitHub",
    "comments" : [
      {
        "id" : "cea146ab-e819-4a25-8dc3-cfbc7cf86056",
        "parentId" : null,
        "authorId" : "659587dc-b401-4c91-aa40-a8a932100545",
        "body" : "Do end users understand 'patterns' in this context? I'm thinking - what would I search for? and for me, I'd search something like 'how to limit my ansible playbook to a set of hosts'? or something like that. I wouldn't think to call it ansible patterns for example.",
        "createdAt" : "2019-10-03T20:06:49Z",
        "updatedAt" : "2019-10-07T22:51:30Z",
        "lastEditedBy" : "659587dc-b401-4c91-aa40-a8a932100545",
        "tags" : [
        ]
      },
      {
        "id" : "e1c18fe7-5b5b-4636-b665-f8d785c18525",
        "parentId" : "cea146ab-e819-4a25-8dc3-cfbc7cf86056",
        "authorId" : "0d301bd1-6b47-409f-ac92-439b799b2375",
        "body" : "I agree it's obscure - I didn't understand what a \"pattern\" was at first myself. But it is the accepted term, and \"limit\" means something different in Ansible. If we use \"pattern\" elsewhere in the User Guide, I hope the term and concept will gain more traction. Expanding the title should help users find this content - it's tough to create a title that offers context without getting too long for the left nav. Alternate ideas welcome!",
        "createdAt" : "2019-10-07T16:12:36Z",
        "updatedAt" : "2019-10-07T22:51:30Z",
        "lastEditedBy" : "0d301bd1-6b47-409f-ac92-439b799b2375",
        "tags" : [
        ]
      }
    ],
    "commit" : "8ff70dffec8e807ae4bebad20934b8b00d276b51",
    "line" : 6,
    "diffHunk" : "@@ -1,1 +2,6 @@\nPatterns: targeting hosts and groups\n====================================\n\nWhen you execute Ansible through an ad-hoc command or by running a playbook, you must choose which managed nodes or groups you want to execute against. Patterns let you run commands and playbooks against specific hosts and/or groups in your inventory. An Ansible pattern can refer to a single host, an IP address, an inventory group, a set of groups, or all hosts in your inventory. Patterns are highly flexible - you can exclude or require subsets of hosts, use wildcards or regular expressions, and more. Ansible executes on all inventory hosts included in the pattern."
  }
]