[
  {
    "id" : "a6442544-b836-4674-904c-737c70cf760f",
    "prId" : 69749,
    "prUrl" : "https://github.com/ansible/ansible/pull/69749#pullrequestreview-427984367",
    "prSource" : "GitHub",
    "comments" : [
      {
        "id" : "29024981-2b4c-4966-ab37-0c44dc9cc4a8",
        "parentId" : null,
        "authorId" : "83b3a34a-be7a-4a54-86ec-062824ef0ef5",
        "body" : "Is there some place in the documentation for people who are developing Collections or Roles?  I'd like to add a note there about the idiomatic use of Collection or Role variables beginning with an underscore to indicate that the variable is \"protected\" or \"private\" to the Collection or Role and should not be used outside of the Collection or Role.",
        "createdAt" : "2020-05-28T20:56:15Z",
        "updatedAt" : "2020-06-10T20:52:05Z",
        "lastEditedBy" : "83b3a34a-be7a-4a54-86ec-062824ef0ef5",
        "tags" : [
        ]
      },
      {
        "id" : "2960f114-6078-40f7-b1e4-1e77a9bafdea",
        "parentId" : "29024981-2b4c-4966-ab37-0c44dc9cc4a8",
        "authorId" : "a04e0029-6020-483e-a64d-5d46980699f6",
        "body" : "@richm I haven't seen any documentation on best practices for role development in Ansible docs (as opposed to playbook and module development, which are amply documented). The only relevant guidelines I saw are the OASIS standards and the guidelines for other similar projects that are referenced from here: https://github.com/oasis-roles/meta_standards#references .\r\nI believe such notes about idiomatic use do not really belong to the present document, which only specifies what is allowed and how things work and is not very prescriptive.",
        "createdAt" : "2020-06-10T12:05:42Z",
        "updatedAt" : "2020-06-10T20:52:05Z",
        "lastEditedBy" : "a04e0029-6020-483e-a64d-5d46980699f6",
        "tags" : [
        ]
      }
    ],
    "commit" : "8b7952a4e39ad1dc40e2386265298b09cd83ac9a",
    "line" : 7,
    "diffHunk" : "@@ -1,1 +21,25 @@Not all strings are valid Ansible variable names. A variable name can only include letters, numbers, and underscores. `Python keywords`_ and :ref:`playbook keywords<playbook_keywords>` are not valid variable names. A variable name cannot begin with a number.\n\nVariable names can begin with an underscore. In many programming languages, variables that begin with an underscore are private. This is not true in Ansible. Variables that begin with an underscore are treated exactly the same as any other variable. Do not rely on this convention for privacy or security.\n\n.. table::"
  }
]