[
  {
    "id" : "8e789ab3-125c-4ef4-be56-77c8408f271e",
    "prId" : 65474,
    "prUrl" : "https://github.com/ansible/ansible/pull/65474#pullrequestreview-330104380",
    "prSource" : "GitHub",
    "comments" : [
      {
        "id" : "cc5e1639-5a09-40b3-95f0-3cb74c53ead5",
        "parentId" : null,
        "authorId" : "d7d8721c-7ad0-4834-9a3d-b53ca8656789",
        "body" : "Assuming this is page zero, which pages are we assuming they've already read?",
        "createdAt" : "2019-12-10T18:29:00Z",
        "updatedAt" : "2019-12-12T17:43:10Z",
        "lastEditedBy" : "d7d8721c-7ad0-4834-9a3d-b53ca8656789",
        "tags" : [
        ]
      },
      {
        "id" : "564a331f-dd12-4008-a0f2-f4b60e9b6840",
        "parentId" : "cc5e1639-5a09-40b3-95f0-3cb74c53ead5",
        "authorId" : "0d301bd1-6b47-409f-ac92-439b799b2375",
        "body" : "I'm not entirely sure at this stage. The last step in the User Guide rewrite will be revamping all the various TOCs within it. I'd prefer to treat every page as Page Zero, because most users will come from search engine results, but also offer a reasonable \"Zero to Sixty for Ansible Engine\" tutorial if you follow the TOC. ",
        "createdAt" : "2019-12-10T19:55:19Z",
        "updatedAt" : "2019-12-12T17:43:10Z",
        "lastEditedBy" : "0d301bd1-6b47-409f-ac92-439b799b2375",
        "tags" : [
        ]
      }
    ],
    "commit" : "d08f1559bac04ff2d48bc58a260f020a5370e5f6",
    "line" : 7,
    "diffHunk" : "@@ -1,1 +5,9 @@********************\n\nYou have learned about playbooks, inventory, roles, and variables. This section pulls all those elements together, outlining a sample setup for automating a web service. You can find more example playbooks illustrating these patterns in our `ansible-examples repository <https://github.com/ansible/ansible-examples>`_.  (NOTE: These may not use all of the features in the latest release, but are still an excellent reference!).\n\nThe sample setup organizes playbooks, roles, inventory, and variables files by function, with tags at the play and task level for greater granularity and control. This is a powerful and flexible approach, but there are other ways to organize Ansible content. Your usage of Ansible should fit your needs, not ours, so feel free to modify this approach and organize your content as you see fit."
  }
]