[
  {
    "id" : "0edcdd36-601c-45dc-8d7f-1fa069a1fcf5",
    "prId" : 68236,
    "prUrl" : "https://github.com/kubernetes/kubernetes/pull/68236#pullrequestreview-152569327",
    "prSource" : "GitHub",
    "comments" : [
      {
        "id" : "ce2f5e29-4007-4500-9450-9b2d94172e64",
        "parentId" : null,
        "authorId" : "839423f5-3004-4805-a7aa-d21199e00bd4",
        "body" : "Because \"...is still 2 - 3 releases out...\" is relative, it would be beneficial for clarity here to note instead some absolute range such as \"...is not expected until early or mid 2019...\" if you're willing to put a more concrete stake in the ground.",
        "createdAt" : "2018-09-05T15:52:32Z",
        "updatedAt" : "2018-09-05T15:53:41Z",
        "lastEditedBy" : "839423f5-3004-4805-a7aa-d21199e00bd4",
        "tags" : [
        ]
      },
      {
        "id" : "929c854f-065c-4463-8a8f-76b1615a62f4",
        "parentId" : "ce2f5e29-4007-4500-9450-9b2d94172e64",
        "authorId" : "6dd71efb-88b1-4bb0-b30a-0df658362f14",
        "body" : "We're talking about this in our SIG meeting today, will update once we've agreed on a more concrete timeline ! ",
        "createdAt" : "2018-09-05T15:57:43Z",
        "updatedAt" : "2018-09-05T15:57:43Z",
        "lastEditedBy" : "6dd71efb-88b1-4bb0-b30a-0df658362f14",
        "tags" : [
        ]
      }
    ],
    "commit" : "52bfbd45aea7277bcf662542a7c4b0300d6afb3d",
    "line" : 25,
    "diffHunk" : "@@ -1,1 +11,15 @@* Attempts to contribute new cloud providers or (to a lesser extent) persistent volumes to the core repo will likely meet with some pushback from reviewers/approvers.\n* It is understood that this is an unfortunate situation in which 'the old way is no longer supported but the new way is not ready yet', but the initial path is unsustainable, and contributors are encouraged to participate in the implementation of the proposed long-term solution, as there is risk that PRs for new cloud providers here will not be approved.\n* Though the fully productized support envisioned in the proposal is still 2 - 3 releases out, the foundational work is underway, and a motivated cloud provider could accomplish the work in a forward-looking way. Contributors are encouraged to assist with the implementation of the design outlined in the proposal.\n\n#### Some additional context on status / direction:"
  }
]