[
  {
    "id" : "6f287107-18e6-478b-ac49-0480a2c1f3d5",
    "prId" : 4431,
    "prUrl" : "https://github.com/zio/zio/pull/4431#pullrequestreview-538911252",
    "prSource" : "GitHub",
    "comments" : [
      {
        "id" : "131bfaab-6a29-4fd4-b3dc-13be7b3f5156",
        "parentId" : null,
        "authorId" : "e51a12a9-b5b7-4e30-a51d-293206825c6f",
        "body" : "Minor comment and I realize it was already this way but shouldn't each of these paragraphs be a single line of markdown and then they will be rendered based on the screen versus us manually adding all these line breaks? I feel like this is going to make it look weird and bad on some screens.",
        "createdAt" : "2020-11-24T04:01:13Z",
        "updatedAt" : "2020-11-25T14:21:11Z",
        "lastEditedBy" : "e51a12a9-b5b7-4e30-a51d-293206825c6f",
        "tags" : [
        ]
      },
      {
        "id" : "93545276-0819-4ef0-8461-1e7758348d75",
        "parentId" : "131bfaab-6a29-4fd4-b3dc-13be7b3f5156",
        "authorId" : "5c0ecc69-d802-4c0f-ab05-4f47b29387e8",
        "body" : "@adamgfraser do you mean in an editor, or when the markdown is rendered to HTML? FWIW, \"weird and bad\" is subjective, but I'd like to know what you mean.\r\n\r\nIt looks perfectly fine in my editor, and markdown renderers will usually ignore line breaks that are not explicitly followed by a space character and combine them into a single `<p>` tag.\r\n\r\nI tend to prefer keeping my code to <= 80 chars wide because it makes the code easier to see in a small screen context, or when I have a split-screen view of some code. I don't own the coding styles for ZIO, of course, so I have no real iron in this fire.\r\n\r\nI will update my PR to make every paragraph a single line of markdown, let me know if that is what you would prefer.",
        "createdAt" : "2020-11-25T14:12:44Z",
        "updatedAt" : "2020-11-25T14:21:11Z",
        "lastEditedBy" : "5c0ecc69-d802-4c0f-ab05-4f47b29387e8",
        "tags" : [
        ]
      },
      {
        "id" : "856460d9-e319-4716-a659-257fe1a6b1cf",
        "parentId" : "131bfaab-6a29-4fd4-b3dc-13be7b3f5156",
        "authorId" : "5c0ecc69-d802-4c0f-ab05-4f47b29387e8",
        "body" : "@adamgfraser I've only updated the whitespace of paragraphs that I added as entirely new paragraphs to avoid code churn. I think it's worthwhile to adopt a consistent code formatting convention for markdown if possible. I know little about the options but they exist:\r\n- https://github.com/markdownlint/markdownlint\r\n- https://github.com/DavidAnson/markdownlint\r\n\r\nIf that seems reasonable, let me know. If we can identify a consensus on formatting markdown I can try to tackle this. Would probably be ideal to unify the formatting of all markdown in a single commit to avoid whitespace commit noise.",
        "createdAt" : "2020-11-25T14:24:41Z",
        "updatedAt" : "2020-11-25T14:24:41Z",
        "lastEditedBy" : "5c0ecc69-d802-4c0f-ab05-4f47b29387e8",
        "tags" : [
        ]
      },
      {
        "id" : "b0b2bbd2-5d00-4ea5-9b6c-75f41adb38c5",
        "parentId" : "131bfaab-6a29-4fd4-b3dc-13be7b3f5156",
        "authorId" : "e51a12a9-b5b7-4e30-a51d-293206825c6f",
        "body" : "Maybe it doesn't make that much of a difference. I was worried that manually adding those breaks could for example result in line breaks being inserted too early on wide screens but maybe that is dealt with separately. Looking through the rest of the documentation it looks like one line per paragraph is more common but it is not completely consistent. Anyway, thanks for all your work on this. Will merge when it passes CI.",
        "createdAt" : "2020-11-25T15:43:10Z",
        "updatedAt" : "2020-11-25T15:43:10Z",
        "lastEditedBy" : "e51a12a9-b5b7-4e30-a51d-293206825c6f",
        "tags" : [
        ]
      },
      {
        "id" : "ce310172-941c-447f-b111-1c8b07051e8a",
        "parentId" : "131bfaab-6a29-4fd4-b3dc-13be7b3f5156",
        "authorId" : "5c0ecc69-d802-4c0f-ab05-4f47b29387e8",
        "body" : "Thanks! I'm all for one-line-per-paragraph. I've seen folks using dedicated markdown editors (as opposed to something IDE-like) and in that context especially that is a much more natural way to format the text.",
        "createdAt" : "2020-11-25T23:57:13Z",
        "updatedAt" : "2020-11-25T23:57:13Z",
        "lastEditedBy" : "5c0ecc69-d802-4c0f-ab05-4f47b29387e8",
        "tags" : [
        ]
      }
    ],
    "commit" : "5606ac83526a5ddb3b30400621a27afd651c3ed6",
    "line" : 77,
    "diffHunk" : "@@ -1,1 +133,137 @@\n In this example, we can see that `ModuleC` depends upon `ModuleA`, `ModuleB`, and `Clock`. The layer provided to the runnable application shows how dependency layers can be combined using `++` into a single combined layer. The combined layer will then be able to produce both of the outputs of the original layers as a single layer.\n\n```scala mdoc:silent\nimport zio._"
  }
]